-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Хост: mysql_8
-- Время создания: Май 18 2023 г., 07:42
-- Версия сервера: 8.0.33
-- Версия PHP: 7.4.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `api_weather_db`
--

-- --------------------------------------------------------

--
-- Структура таблицы `tt_cities`
--

CREATE TABLE `tt_cities` (
  `id` int NOT NULL,
  `name` varchar(50) NOT NULL,
  `latitude` double(10,6) NOT NULL,
  `longitude` double(10,6) NOT NULL,
  `country` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `tt_cities`
--

INSERT INTO `tt_cities` (`id`, `name`, `latitude`, `longitude`, `country`) VALUES
(1, 'Абакан', 53.720976, 91.442423, 'Россия'),
(2, 'Архангельск', 64.539304, 40.518735, 'Россия'),
(3, 'Астана', 71.430564, 51.128422, 'Россия'),
(4, 'Астрахань', 46.347869, 48.033574, 'Россия'),
(5, 'Барнаул', 53.356132, 83.749619, 'Россия'),
(6, 'Белгород', 50.597467, 36.588849, 'Россия'),
(7, 'Бийск', 52.541444, 85.219686, 'Россия'),
(8, 'Благовещенск', 50.290658, 127.527173, 'Россия'),
(9, 'Братск', 56.151382, 101.634152, 'Россия'),
(10, 'Брянск', 53.243400, 34.364198, 'Россия'),
(11, 'Великий Новгород', 58.521475, 31.275475, 'Россия'),
(12, 'Владивосток', 43.134019, 131.928379, 'Россия'),
(13, 'Владикавказ', 43.024122, 44.690476, 'Россия'),
(14, 'Владимир', 56.129042, 40.407030, 'Россия'),
(15, 'Волгоград', 48.707103, 44.516939, 'Россия'),
(16, 'Вологда', 59.220492, 39.891568, 'Россия'),
(17, 'Воронеж', 51.661535, 39.200287, 'Россия'),
(18, 'Грозный', 43.317992, 45.698197, 'Россия'),
(19, 'Екатеринбург', 56.838002, 60.597295, 'Россия'),
(20, 'Иваново', 57.000348, 40.973921, 'Россия'),
(21, 'Ижевск', 56.852775, 53.211463, 'Россия'),
(22, 'Иркутск', 52.286387, 104.280660, 'Россия'),
(23, 'Казань', 55.795793, 49.106585, 'Россия'),
(24, 'Калининград', 55.916229, 37.854467, 'Россия'),
(25, 'Калуга', 54.507014, 36.252277, 'Россия'),
(26, 'Каменск-Уральский', 56.414897, 61.918905, 'Россия'),
(27, 'Кемерово', 55.359594, 86.087781, 'Россия'),
(28, 'Киров', 54.079033, 34.323163, 'Россия'),
(29, 'Комсомольск-на-Амуре', 50.549860, 137.007867, 'Россия'),
(30, 'Королев', 55.916229, 37.854467, 'Россия'),
(31, 'Кострома', 57.767683, 40.926418, 'Россия'),
(32, 'Краснодар', 45.023877, 38.970157, 'Россия'),
(33, 'Красноярск', 56.008691, 92.870529, 'Россия'),
(34, 'Курск', 51.730361, 36.192647, 'Россия'),
(35, 'Липецк', 52.610220, 39.594719, 'Россия'),
(36, 'Магнитогорск', 53.411677, 58.984415, 'Россия'),
(37, 'Махачкала', 42.984913, 47.504646, 'Россия'),
(38, 'Москва', 55.755773, 37.617761, 'Россия'),
(39, 'Мурманск', 68.969562, 33.074540, 'Россия'),
(40, 'Набережные Челны', 55.743553, 52.395820, 'Россия'),
(41, 'Нижний Новгород', 56.323902, 44.002267, 'Россия'),
(42, 'Нижний Тагил', 57.910144, 59.981320, 'Россия'),
(43, 'Новокузнецк', 53.786502, 87.155205, 'Россия'),
(44, 'Новороссийск', 44.723489, 37.768660, 'Россия'),
(45, 'Новосибирск', 55.028739, 82.906927, 'Россия'),
(46, 'Норильск', 69.349039, 88.201014, 'Россия'),
(47, 'Омск', 54.989342, 73.368212, 'Россия'),
(48, 'Орел', 52.970306, 36.063514, 'Россия'),
(49, 'Оренбург', 51.768060, 55.097449, 'Россия'),
(50, 'Пенза', 53.194546, 45.019529, 'Россия'),
(51, 'Первоуральск', 56.908099, 59.942935, 'Россия'),
(52, 'Пермь', 58.004785, 56.237654, 'Россия'),
(53, 'Прокопьевск', 53.895355, 86.744657, 'Россия'),
(54, 'Псков', 57.819365, 28.331786, 'Россия'),
(55, 'Ростов-на-Дону', 47.227151, 39.744972, 'Россия'),
(56, 'Рыбинск', 58.138530, 38.573586, 'Россия'),
(57, 'Рязань', 54.619886, 39.744954, 'Россия'),
(58, 'Самара', 53.195533, 50.101801, 'Россия'),
(59, 'Санкт-Петербург', 59.938806, 30.314278, 'Россия'),
(60, 'Саратов', 51.531528, 46.035820, 'Россия'),
(61, 'Севастополь', 44.616649, 33.525360, 'Россия'),
(63, 'Северодвинск', 64.558186, 39.829620, 'Россия'),
(64, 'Симферополь', 44.952116, 34.102411, 'Россия'),
(65, 'Сочи', 43.581509, 39.722882, 'Россия'),
(66, 'Ставрополь', 45.044502, 41.969065, 'Россия'),
(67, 'Тамбов', 52.721246, 41.452238, 'Россия'),
(68, 'Тверь', 56.859611, 35.911896, 'Россия'),
(69, 'Тольятти', 53.511311, 49.418084, 'Россия'),
(70, 'Томск', 56.495116, 84.972128, 'Россия'),
(71, 'Тула', 54.193033, 37.617752, 'Россия'),
(72, 'Тюмень', 57.153033, 65.534328, 'Россия'),
(73, 'Улан-Удэ', 51.833507, 107.584125, 'Россия'),
(74, 'Ульяновск', 54.317002, 48.402243, 'Россия'),
(75, 'Уфа', 54.734768, 55.957838, 'Россия'),
(76, 'Хабаровск', 48.472584, 135.057732, 'Россия'),
(77, 'Чебоксары', 56.143900, 47.248887, 'Россия'),
(78, 'Челябинск', 55.159774, 61.402455, 'Россия'),
(79, 'Шахты', 47.708485, 40.215958, 'Россия'),
(80, 'Энгельс', 51.498891, 46.125121, 'Россия'),
(81, 'Южно-Сахалинск', 46.959118, 142.738068, 'Россия'),
(82, 'Якутск', 62.027833, 129.704151, 'Россия'),
(83, 'Ярославль', 57.626569, 39.893822, 'Россия');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `tt_cities`
--
ALTER TABLE `tt_cities`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `tt_cities`
--
ALTER TABLE `tt_cities`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=84;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
